frontend/modules/evaluation/views/default/dashboard.php

                    ])->label(false)->hint('Period')  ;?>
        </div>
        <div class="col-lg-2">
                <?= $form->field($model, 'agency_id', ['template' => '{hint} {input}'])->widget(Select2::classname(), [
                        'data' => ArrayHelper::map(Agency::find()->orderBy(['agency_id'=>SORT_ASC])->all(),'agency_id','name'),
                        'language' => 'de',
                        'options' => ['placeholder' => ''],
                        'pluginOptions' => [
                            'allowClear' => true,
                            'width' => '200px',
                        ],
                        'size' => Select2::SMALL,

                    ])->label(false)->hint('Agency')  ;?>
        </div>
        <div class="col-lg-2">
                <?= $form->field($model, 'business_unit_id', ['template' => '{hint} {input}'])->widget(Select2::classname(), [
                        'data' => ArrayHelper::map(Businessunit::find()->orderBy(['business_unit_id'=>SORT_ASC])->all(),'business_unit_id','name'),
                        'language' => 'de',
                        'options' => ['placeholder' => ''],
                        'pluginOptions' => [
                            'allowClear' => true,
                            'width' => '200px',
                        ],
                        'size' => Select2::SMALL,
                    ])->label(false)->hint('Business Unit')  ;?>
---
SELECT * FROM `tbl_agency` ORDER BY `agency_id`
SELECT * FROM `tbl_business_unit` ORDER BY `business_unit_id`