frontend/modules/evaluation/views/agencyprofile/view.php

SELECT * FROM `tbl_agency` ORDER BY `agency_id`
---
                'inputContainer' => ['class'=>'col-sm-6'],
                'value' => $model->agency->name,
                'type'=>DetailView::INPUT_SELECT2,
                'widgetOptions'=>[
                    'data'=>ArrayHelper::map(Agency::find()->orderBy(['agency_id'=>SORT_ASC])->all(),'agency_id','name'),
                    'options' => ['placeholder' => 'Select Agency'],
                    'pluginOptions' => ['allowClear'=>true, 'width'=>'100%'],
                ],