frontend/modules/evaluation/controllers/AgencyprofileController.php

    protected function findModel($id)
    {
        if (($model = Agencyprofile::findOne($id)) !== null) {
---
SELECT * FROM `tbl_agency_profile` WHERE `agency_profile_id`='1'