frontend/modules/evaluation/controllers/DefaultController.php

    public function actionDashboard($period = NULL, $agencyID = NULL, $businessUnitId = NULL)
    {
        $model = new DashboardForm();
        $filter = $model->load(Yii::$app->request->post());

        if ($model->load(Yii::$app->request->post())) {
            //return $this->refresh();
            $respondents = Feedback::find()->where(['agency_id' => $model->agency_id, 'business_unit_id' => $model->business_unit_id])->count();
            $csfResults = $this->csfResult($respondents, $model->business_unit_id);
            $csfRating = $this->csfRating($respondents, $csfResults);
            $csf['respondents'] = $respondents;
            $csf['result'] = $csfRating;
            $csf['rating'] = $this->satisfactionIndex($csfRating);
            $csf['nps'] = $this->getNetPromoterScore($respondents);

            return $this->render('dashboard', [
                'model' => $model,
                'respondents' => $respondents,
                'csf' => $csf,
                //'csfResults' => $csfResults,
                //'csfRating' => $csfRating,
                //'post' => Yii::$app->request->post(),
            ]);
        } else {
            //$respondents = Feedback::find()->where(['agency_id' => 1])->count();
            $respondents = Feedback::find()->count();
---
SELECT COUNT(*) FROM `tbl_feedback`

                $index++;
            }
        }else{
            $attributes = Evaluationattribute::find()->asArray()->all();
---
SELECT * FROM `tbl_evaluation_attribute`

    public function getDeliveryRatingTally($evaluationAttributeId, $rating)
    {
        return Deliveryrating::find()->where(['evaluation_attribute_id' => $evaluationAttributeId, 'rating' => $rating])->count();
---
SELECT COUNT(*) FROM `tbl_delivery_rating` WHERE (`evaluation_attribute_id`='1') AND (`rating`=1)

    public function getImportanceRatingTally($evaluationAttributeId, $rating)
    {
        return Importancerating::find()->where(['evaluation_attribute_id' => $evaluationAttributeId, 'rating' => $rating])->count();
---
SELECT COUNT(*) FROM `tbl_importance_rating` WHERE (`evaluation_attribute_id`='1') AND (`rating`=1)

    public function getNetPromoterScore($respondents)
    {
        $promoters = Promotion::find()->where('rating > 8')->count();
        $passives = Promotion::find()->andWhere(['or',
                                                   ['rating'=>7],
                                                   ['rating'=>8]
                                               ])->count();
        //::find()->where(['between', 'date', "2014-12-31", "2015-02-31" ])->all();
        $detractors = Promotion::find()->where('rating < 7')->count();
---
SELECT COUNT(*) FROM `tbl_promotion` WHERE rating > 8
SELECT COUNT(*) FROM `tbl_promotion` WHERE (`rating`=7) OR (`rating`=8)
SELECT COUNT(*) FROM `tbl_promotion` WHERE rating < 7

    public function actionReports($id,$month,$year){

        /***********************************
         * AUTHOR: EDUARDO R. ZARAGOZA JR. *
         * DATE CREATED: DEC 01, 2020      *
         * DOST Regional Office IX         *
         *  ---EL PASIL NO ASE DIPISIL---  *
         ***********************************/

        $agencyprofile = Agencyprofile::find()->one();


        if(!Yii::$app->user->isGuest){
            $CurrentUser = User::findOne(['user_id'=> Yii::$app->user->identity->user_id]);
            $CurrentAgencyid = $CurrentUser->profile->agency_id;
        }


        /*--------delivery rating--------*/
        $feedback = Feedback::find();
        $totalresponse = $feedback->select(['count(*) as totalresponse'])
                                  ->where(['month(feedback_date)' => $month,'year(feedback_date)' => $year,'business_unit_id' => $id,'agency_id' => $CurrentAgencyid])
                                  ->asArray()
                                  ->one();
        $evaluationAttribs = Evaluationattribute::find()->where(['business_unit_id'=>$id])->asArray()->all();
---
SELECT * FROM `tbl_agency_profile`
SELECT count(*) AS `totalresponse` FROM `tbl_feedback` WHERE (month(feedback_date)='12') AND (year(feedback_date)='2020') AND (`business_unit_id`='30') AND (`agency_id`=1)
SELECT * FROM `tbl_evaluation_attribute` WHERE `business_unit_id`='30'

            ->asArray()->one();
        }

            $customerExperiencerating5 = CustomerExperience::find()
                ->select(['rate5' => 'COUNT(*)'])
                ->where(['tbl_feedback.business_unit_id' => $id,
                        'MONTH(tbl_feedback.feedback_date)' => $month,
                         'YEAR(tbl_feedback.feedback_date)' => $year,
                        'tbl_feedback.agency_id' => $CurrentAgencyid,
                        'rating' => 5])
                ->joinWith('feedback',false)
                ->asArray()
                ->one();
            $customerExperiencerating4 = CustomerExperience::find()
                ->select(['rate4' => 'COUNT(*)'])
                ->where(['tbl_feedback.business_unit_id' => $id,
                        'MONTH(tbl_feedback.feedback_date)' => $month,
                         'YEAR(tbl_feedback.feedback_date)' => $year,
                        'tbl_feedback.agency_id' => $CurrentAgencyid,
                        'rating' => 4])
                ->joinWith('feedback',false)
                ->asArray()
                ->one();
            $customerExperiencerating3 = CustomerExperience::find()
                ->select(['rate3' => 'COUNT(*)'])
                ->where(['tbl_feedback.business_unit_id' => $id,
                        'MONTH(tbl_feedback.feedback_date)' => $month,
                         'YEAR(tbl_feedback.feedback_date)' => $year,
                        'tbl_feedback.agency_id' => $CurrentAgencyid,
                        'rating' => 3])
                ->joinWith('feedback',false)
                ->asArray()
                ->one();
            $customerExperiencerating2 = CustomerExperience::find()
                ->select(['rate2' => 'COUNT(*)'])
                ->where(['tbl_feedback.business_unit_id' => $id,
                        'MONTH(tbl_feedback.feedback_date)' => $month,
                         'YEAR(tbl_feedback.feedback_date)' => $year,
                        'tbl_feedback.agency_id' => $CurrentAgencyid,
                        'rating' => 2])
                ->joinWith('feedback',false)
                ->asArray()
                ->one();
---
SELECT COUNT(*) AS `rate4` FROM `tbl_customer_experience` LEFT JOIN `tbl_feedback` ON `tbl_customer_experience`.`feedback_id` = `tbl_feedback`.`feedback_id` WHERE (`tbl_feedback`.`business_unit_id`='30') AND (MONTH(tbl_feedback.feedback_date)='12') AND (YEAR(tbl_feedback.feedback_date)='2020') AND (`tbl_feedback`.`agency_id`=1) AND (`rating`=4)
SELECT COUNT(*) AS `rate3` FROM `tbl_customer_experience` LEFT JOIN `tbl_feedback` ON `tbl_customer_experience`.`feedback_id` = `tbl_feedback`.`feedback_id` WHERE (`tbl_feedback`.`business_unit_id`='30') AND (MONTH(tbl_feedback.feedback_date)='12') AND (YEAR(tbl_feedback.feedback_date)='2020') AND (`tbl_feedback`.`agency_id`=1) AND (`rating`=3)
SELECT COUNT(*) AS `rate2` FROM `tbl_customer_experience` LEFT JOIN `tbl_feedback` ON `tbl_customer_experience`.`feedback_id` = `tbl_feedback`.`feedback_id` WHERE (`tbl_feedback`.`business_unit_id`='30') AND (MONTH(tbl_feedback.feedback_date)='12') AND (YEAR(tbl_feedback.feedback_date)='2020') AND (`tbl_feedback`.`agency_id`=1) AND (`rating`=2)
SELECT COUNT(*) AS `rate1` FROM `tbl_customer_experience` LEFT JOIN `tbl_feedback` ON `tbl_customer_experience`.`feedback_id` = `tbl_feedback`.`feedback_id` WHERE (`tbl_feedback`.`business_unit_id`='30') AND (MONTH(tbl_feedback.feedback_date)='12') AND (YEAR(tbl_feedback.feedback_date)='2020') AND (`tbl_feedback`.`agency_id`=1) AND (`rating`=1)